const cardsData = [
  {
    image: "./assets/images/int_default.jpg",
    title:
      "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار الثاني لشهر مارس 2025 ضمن برنامج صكوك حكومة المملكة ...",
    date: "09/28/1446",
    content:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
  },
  {
    image: "./assets/images/int_default.jpg",
    title:
      "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار الثاني لشهر مارس 2025 ضمن برنامج صكوك حكومة المملكة ...",
    date: "09/28/1446",
    content:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
  },
  {
    image: "./assets/images/int_default.jpg",
    title:
      "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار الثاني لشهر مارس 2025 ضمن برنامج صكوك حكومة المملكة ...",
    date: "09/28/1446",
    content:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
  },
  {
    image: "./assets/images/int_default.jpg",
    title:
      "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار الثاني لشهر مارس 2025 ضمن برنامج صكوك حكومة المملكة ...",
    date: "09/28/1446",
    content:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
  },
  {
    image: "./assets/images/int_default.jpg",
    title:
      "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار الثاني لشهر مارس 2025 ضمن برنامج صكوك حكومة المملكة ...",
    date: "09/28/1446",
    content:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
  },
  {
    image: "./assets/images/int_default.jpg",
    title:
      "أعلن المركز الوطني لإدارة الدين الانتهاء من استقبال طلبات المستثمرين على الإصدار الثاني لشهر مارس 2025 ضمن برنامج صكوك حكومة المملكة ...",
    date: "09/28/1446",
    content:
      "وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك. وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.وصف الخدمة مثل لشراء قطعة أرض لبناء منزلك، يتطلب ذلك توثيق عملية البيع والشراء في مكاتب التوثيق أو خدمات الكاتب العدل لتسجيل العقار باسمك.",
  },
  
];

const card = document.getElementById("cards");

function renderNewsCards(data) {
  card.innerHTML = "";

  data.forEach((item, index) => {   
    const col = document.createElement("div");
    col.className = "col-lg-4 col-md-6";

    col.innerHTML = `
      <article class="card">
        <div class="card-wrapper">
          <img src="${item.image}" alt="خبر" class="img-fluid">
        </div>
        <div class="card-body">
          <h3 class="card-title-text">${item.title}</h3>
          <time class="card-date">${item.date}</time>
          <button class="btn btn-read-more" data-index="${index}">قراءة المزيد</button>
        </div>
      </article>
    `;

    card.appendChild(col);
  });
}

renderNewsCards(cardsData);
const modal = document.getElementById("newsModal");
const modalImage = document.getElementById("modalImage");
const modalTitle = document.getElementById("modalTitle");
const modalDate = document.getElementById("modalDate");
const modalText = document.getElementById("modalText");
const closeBtn = document.querySelector(".news-modal-close");
const overlay = document.querySelector(".news-modal-overlay");

document.addEventListener("click", function (e) {
  if (e.target.classList.contains("btn-read-more")) {
    const index = e.target.dataset.index;
    const item = cardsData[index];  

    if (!item) return; 

    modalImage.src = item.image;
    modalTitle.textContent = item.title;
    modalDate.textContent = item.date;
    modalText.textContent = item.content;

    modal.classList.add("active");
    document.body.style.overflow = "hidden";
  }
});

function closeModal() {
  modal.classList.remove("active");
  document.body.style.overflow = "auto";
}

closeBtn.addEventListener("click", closeModal);
overlay.addEventListener("click", closeModal);
